Repository: definitivedrupal/dgd7
Catalog: drupal/sites/all/modules/pathauto/translations/*.po
Languages: ru

source: <p>Provides a mechanism for modules to automatically generate aliases for the content they manage.</p> <h2>Settings</h2> <p>The <strong>Maximum Alias Length</strong> and <strong>Maximum component length</strong> values default to 100 and have a limit of 128 from pathauto. This length is limited by the length of the dst column of the url_alias database table. The default database schema for this column is 128. If you set a length that is equal to that of the one set in the dst column it will cause problems in situations where the system needs to append additional words to the aliased URL. For example... URLs generated for feeds will have '/feed' added to the end. You should enter a value that is the length of the dst column minus the length of any strings that might get added to the end of the URL. The length of strings that might get added to the end of your URLs depends on which modules you have enabled and on your Pathauto settings. The recommended and default value is 100.</p>
ru: <p>Модуль pathauto позволяет использовать функцию автоматического создания синонимов (alias) для других модулей, на основании указанных критериев, с централизованной настройкой путей для администраторов сайта.</p><p>Поддерживаются базовые типы материалов: узлы, термы таксономии, пользователи, и блоги.</p><p>Помимо создания более осмысленного адреса страницы, говорящего о его содержимом, чем просто "node/138", также важно знать, что современные механизмы поиска придают большое значение словам, появляющимся в URL страницы. Автоматическое использование ключевых слов, берущихся из самого содержания страницы в URL, значительно увеличивают соответствующие индексы популярности в механизмах поиска для вашей страницы.</p> <h2>Настройки</h2> <p><strong>Максимальная длина синонима</strong> и <strong>Максимальная длина компонента</strong> по умолчанию установленны в 100 символов, лимит этих значений равен 128 символам. Эти значения ограничены величиной колонки dts в таблице url_alias. Если вы установите это значение равное максимальному в базе данных могут появиться проблемы в ситуации, когда системе потребуется добавить дополнительные слова в адресную строку, построенную из синонимаа. Например, адрес сгенерированный для лент новостей будет иметь добавленное окончание '/feed'. Вы должны указать это значение исходя из простой формулы: <em>Длина поля dst минус длина любой строки, которая может быть добавлена в конце, как в случае с окончанием '/feed'.</em> Длина строки, которая может быть добавлена в конце, зависит от того, какие модули у вас включены и от настроек Pathauto.</p><p><strong>Рекомендуется оставить значение по умолчанию в виде 100 символов.</strong></p>

source: You are not authorized to access the pathauto settings.
ru: Авторизируйтесь, чтобы получить доступ к настройкам синонимов.

source: General settings
ru: Основные настройки

source: Verbose
ru: Подробности

source: Display alias changes (except during bulk updates).
ru: Отобразить изменения синонимов (за исключением ситуации больших объемов обновлений)

source: Separator
ru: Разделитель

source: Character used to separate words in titles. This will replace any spaces and punctuation characters.
ru: Символ для разделения слов в строке. Им будут заменены пробелы и символы пунктуации.

source: Quotation marks
ru: Использование кавычек

source: Remove
ru: Удалить

source: Replace by separator
ru: Заменять разделителем

source: Maximum alias length
ru: Максимальная длина синонима

source: Maximum length of aliases to generate. 100 is recommended. See <a href="@pathauto-help">Pathauto help</a> for details.
ru: Максимальная длина генерируемого синонима. Рекомендуемое значение 100. Подробнее смотрите в <a href="@pathauto-help">справке по автопсевдонимам</a>.

source: Maximum component length
ru: Максимальная длина компонента

source: Maximum text length of any component in the alias (e.g., [title]). 100 is recommended. See <a href="@pathauto-help">Pathauto help</a> for details.
ru: Максимальная длина текста любого компонента в синониме (например [title]).Рекомендуемое значение 100. Подробнее смотрите в <a href="@pathauto-help">справке по синонимам</a>.

source: Create index aliases
ru: Создать индекс синонимов

source: When a pattern generates a hierarchical alias (i.e., any alias containing a slash), generate aliases for each step of the hierarchy which can be used to list content within that hierarchy. For example, if a node alias "music/concert/beethoven" is created, also create an alias "music/concert" which will list all concert nodes, and an alias "music" which will list all music nodes.
ru: Если шаблон генерирует иерархические синонимы (т.е. каждый синоним разделен слэшем), будут созданы синонимы для каждой ступени иерархии, которая может быть использована для отображения в списке этой иерархии. Например, если синоним материала создан как "music/concert/beethoven", так же создастся синоним "music/concert", в котором будут перечислены все материалы типа "концерт" , и синоним "music", который будет адресовать всё перечисление музыкальных материалов.

source: Bulk generate index aliases
ru: Массовое создание индекса синонимов

source: Generate index aliases based on all pre-existing aliases.
ru: Создать индекс синонимов на основе всех ранее существовавших.

source: Update action
ru: Обновить действие

source: Do nothing, leaving the old alias intact
ru: Ничего не делать, оставив в старый синоним без изменений

source: Create a new alias in addition to the old alias
ru: Создать новый синоним в дополнение к уже существующим

source: Create a new alias, replacing the old one
ru: Создать новый синоним, заменяя старый

source: What should pathauto do when updating an existing content item which already has an alias?
ru: Что предпринять при обновлении существующего материала, если он имеет синоним?

source: Strings to Remove
ru: Строки для удаления

source: Words to strip out of the URL alias, separated by commas
ru: Слова, разделенные запятой, не включаемые в синоним адреса.

source: Create feed aliases
ru: Создавать синонимы лент

source: Also generate aliases for RSS feeds.
ru: Генерировать синонимы также и для RSS лент

source: Ignoring alias
ru: Игнорирование синонима

source: due to existing path conflict
ru: из-за существующих конфликтов путей

source: Created new alias %dst for %src, replacing %oldalias
ru: Создан новый синоним %dst для %src, заменя %oldalias

source: Created new alias %dst for %src
ru: Создан новый синоним %dst для %src

source: Pathauto
ru: Синонимы

source: Configure how pathauto generates clean URLs for your content.
ru: Настроить как будут генерироваться чистые ссылки для содержимого сайта.

source: administer pathauto
ru: управлять синонимами

source: Provides a mechanism for modules to automatically generate aliases for the content they manage.
ru: Предоставляет модулям механизм автоматического генерирования синонимов (alias) для управляемого модулями содержимого.

source: Node path settings
ru: Настройки адреса материала

source: Default path pattern (applies to all node types with blank patterns below)
ru: Шаблон адреса по умолчанию (будет применено ко всем типам материалов ниже, для которых шаблоны не определены)

source: Bulk update node paths
ru: Массовое обновление адресов материалов

source: Generate aliases for all existing nodes which do not already have aliases.
ru: Сгенерировать синонимы для всех существующих материалов не имеющих синонимы

source: The title of the node, with spaces and punctuation replaced by the separator.
ru: Заголовок материала. Пробельные символы и знаки пунктуации будут заменены разделителем.

source: The id number of the node.
ru: Идентификационный номер (ID) материала.

source: The name of the user who created the node.
ru: Имя пользователя, создавшего материал.

source: The node type (e.g., "page", "story", etc.).
ru: Тип материала (например "page", "story" и т.д.)

source: The year the node was created.
ru: Год создания материала

source: The two-digit month (01-12) the node was created.
ru: Месяц создания материала, состоящий из двух цифр (01-12)

source: The three-letter month (jan-dec) the node was created.
ru: Трехбуквенный (янв-дек) месяц создания материала.

source: The two-digit day of the month (00-31) the node was created.
ru: День создания материала, состоящий из двух цифр (00-31)

source: The three-letter day of the week (sun-sat) that the node was created.
ru: Трехбуквенный (пон-вос) день недели создания материала.

source: The two-digit hour (00-23) the node was created.
ru: Час создания материала, состоящий из двух цифр (00-23)

source: The two-digit minute (00-59) the node was created.
ru: Минута создания материала, состоящяя из двух цифр (00-59)

source: The two-digit second (00-59) the node was created.
ru: Секунда создания материала, состоящяя из двух цифр (00-59)

source: The week number (1-52) of the year the node was created.
ru: Номер недели (1-52) создания материала.

source: The name of the lowest-weight category that the page belongs to.
ru: Синоним для самой легкой по весу категории, к которой принадлежит страница.

source: The alias for the lowest-weight category that the page belongs to. This is useful for long category names. You must first set up aliases for your categories.
ru: Синоним для самой легкой по весу категории, к которой принадлежит страница. Это полезно для категорий с длинными именами. Сперва вы должны назначить вес для категорий.

source: For book pages, the title of the top-level book.
ru: Для страниц подшивок, заголовок верхнего уровня подшивки.

source: For book pages, the full hierarchy from the top-level book.
ru: Для страниц подшивок, полная иерархия с верхнего уровня подшивки.

source: Pattern for all
ru: Шаблон адреса для всех материалов типа "

source: An alias will be automatically generated from the title and other node attributes, in addition to any alias manually provided above.
ru: Синоним будет автоматически сгенерирован из заголовка и атрибутов материала, в дополнение к всем синонимам настраиваемым вручную выше.

source: To control the format of the generated aliases, see the <a href="admin/settings/pathauto">pathauto settings</a>.
ru: Для контролирования и понимания формата генерирования синонимов смотрите <a href="admin/settings/pathauto">справку по автопсевдонимам</a>.

source: Bulk update of nodes completed, one alias generated.
ru: Массовое обновление материалов завершено, @count синоним сгенерирован.

source: The year the event starts.
ru: Год старта события.

source: The two-digit month (01-12) the event starts.
ru: Месяц старта события, состоящий из двух цифр (01-12).

source: The three-letter month (jan-dec) the event starts.
ru: Трехбуквенный месяц (янв-дек) старта события.

source: The two-digit day of the month (00-31) the event starts.
ru: День месяца старта события, состоящий из двух цифр (01-12).

source: The three-letter day of the week (sun-sat) the event starts.
ru: Трехбуквенный день недели (пон-вос) старта события.

source: The week number (1-52) of the year the event starts.
ru: Номер недели (1-52) старта события.

source: Category path settings
ru: Настройки адреса категории

source: Default path pattern (applies to all vocabularies with blank patterns below)
ru: Шаблон адреса по умолчанию (применяется ко всем словарям ниже, для которых шаблоны не определены)

source: The name of the category.
ru: Имя категории

source: The id number of the category.
ru: Идентификационный номер категории

source: Bulk update category paths
ru: Массовое обновление адресов категорий

source: Generate aliases for all existing categories which do not already have aliases.
ru: Сгенерировать синонимы для всех существующих категорий у которых еще нет синонимов.

source: Pattern for all %vocab-name paths
ru: Шаблон для все адресов типа "%vocab-name"

source: Bulk update of terms completed, one alias generated.
ru: Массовое обновление терминов завершено, @count синоним сгенерирован.

source: User path settings
ru: Настройки адреса пользователя

source: Pattern for user account page paths
ru: Шаблон для адресов пользовательских страниц

source: The name of the user.
ru: Имя пользователя.

source: The id number of the user.
ru: Идентификационный номер пользователя.

source: Bulk update user paths
ru: Массовое обновление адресов пользователей

source: Generate aliases for all existing user account pages which do not already have aliases.
ru: Сгенерировать синонимы для всех существующих пользоветелей которые не имеют синонимов.

source: Blog path settings
ru: Настройки адреса блога

source: Pattern for blog page paths
ru: Шаблон для адресов страницы блога

source: Bulk update blog paths
ru: Массовое обновление адресов блогов

source: Generate aliases for all existing blog pages which do not already have aliases.
ru: Сгенирировать синонимы для всех существующих страниц блогов которые не имеют синонимов.

source: User-tracker path settings
ru: Настройки адреса пользовательского трекера

source: Pattern for user-tracker page paths
ru: Шаблон для адреса страницы пользовательского трекера

source: Bulk update user-tracker paths
ru: Массовое обновление адресов пользовательских трекеров

source: Generate aliases for all existing user-tracker pages which do not already have aliases.
ru: Сгенерировать синонимы для всех существующих пользоветельских трекеров которые не имеют синонимов.

source: Bulk update of user tracker pages completed, one alias generated.
ru: Массовое обновление страниц пользовательских трекеров завершено, @count синоним сгенерирован.

source: The vocabulary that the page's first category belongs to.
ru: Словарь страницы, к которой принадлежит первая категория.

source: As [cat], but including its supercategories.
ru: Как и [cat], но в том числе с супер категориями.

source: The name of the menu the node belongs to.
ru: Имя меню к которому пренадлежит материал.

source: The menu path (as reflected in the breadcrumb), not including Home or [menu].
ru: Путь меню (как это отражено в breadcrumb), исключая главную страницу сайта или [menu].

source: Language code of the document
ru: Языковой код документа
