Repository: definitivedrupal/dgd7
Catalog: drupal/sites/all/modules/image_resize_filter/translations/*.po
Languages: nl

source: Image resize filter
nl: Foto herschaalfilter

source: Resizes images to the exact dimensions specified in the &lt;img&gt; tag.
nl: Herschaalt foto's naar de exacte afmetingen opgegevn in de &lt;img&gt;-tag.

source: Image resize settings
nl: Foto herschaalinstellingen

source: The image resize filter will analyze &lt;img&gt; tags and compare the given height and width attributes to the actual file. If the file dimensions are different than those given in the &lt;img&gt; tag, the image will be copied and the src attribute will be updated to point to the resized image.
nl: De foto herschaalfilter zal &lt;img&gt;-tags bekijken en deze vergelijken met het bestand zelf. Als er een verschil is zal er een nieuwe foto worden gemaakt, waarna het src-attribuut naar de nieuwe foto wordt verwezen.

source: Resize images stored
nl: Herschaalfoto's opgeslagen

source: Locally
nl: Lokaal

source: On remote servers
nl: Op externe servers

source: This option will determine which images will be analyzed for &lt;img&gt; tag differences. Enabling resizing of remote images can have performance impacts, as all images in the filtered text needs to be transfered via HTTP each time the filter cache is cleared.
nl: Deze optie zal bepalen welke foto's worden bekeken voor &lt;img&gt;-tagverschillen. Het herschalen van foto's op externe servers kan de prestatie beinvloeden omdat alle foto's in de gefilterde tekst via HTTP moeten worden gehaald, iedere keer dat de filtercache wordt opgeschoond.

source: If resized, add a link to the original image.
nl: Voeg een link naar het origineel toe als de foto herschaald is.

source: Optionally, give it the class
nl: Geef het optioneel een class

source: and/or a rel attribute
nl: en/of een rel-attribuut

source: Link to the original
nl: Link naar het origineel

source: Linking to the original can be helpful to give users a full-size view of the image. Adding the class "thickbox" is helpful if you have installed the <a href="http://drupal.org/project/thickbox">thickbox module</a>. The rel attribute may be useful when used with the <a href="http://drupal.org/project/lightbox2">lightbox2</a> and <a href="http://drupal.org/project/shadowbox">shadowbox</a> modules.
nl: Linken naar het origineel kan behulpzaam zijn om gebruikers de foto te tonen in volledige grootte. De class 'thixkbox' toevoegen is handig als de <a href="http://drupal.org/project/thickbox">thickbox module</a> aanstaat. Het rel-attribuut is handig voor de <a href="http://drupal.org/project/lightbox2">lightbox2</a> en <a href="http://drupal.org/project/shadowbox">shadowbox</a>-modules.

source: The image resize filter has been installed. Before this does anything, the image resize filter needs to be added to one or more input formats. Visit the <a href="!url">input format administration</a> to set up this filter.
nl: Het foto herschaalfilter is geinstalleerd. Voordat dit iets doet moet eerst het herschaalfilter worden aangezet in een invoerformaat. Bezoek de <a href="!url">invoerformaatbeheerpagina</a> om dit te doen.

source: The location of resized images has changed. The currently resized images have been flushed.
nl: De locatie van herschaalde foto's is veranderd. De huidige herschaalde foto is schoongespeld.

source: Image resize allowed difference option removed.
nl: Het toegestane verschil tussen foto herschalen is verwijderd.

source: Previously resized images may have been missing file names. The currently resized images have been flushed.
nl: Eerder herschaalde foto's kunnen missende bestandsnamen hebben. De huidige herschaalde foto's zijn schoongespeld.

source: Filter to automatically scale images to their height and width dimensions.
nl: Filter om automatisch foto's te schalen naar hun hoogte en breedte.
